In [ ]:

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#Create a mew dataframe from a python dictionary
data = {
    'Name': ['John', 'Jane', 'Michael', 'Emily', 'David'],
    'Math': [85, 92, 78, np.nan, 88], #Notice that Emily's Math score is null
    'Science': [78, 45, 85, 91, 82] #There is a failing score in the science column
}

df = pd.DataFrame(data);

df

      Name  Math  Science
0     John  85.0       78
1     Jane  92.0       45
2  Michael  78.0       85
3    Emily   NaN       91
4    David  88.0       82